{"keras_version": "1.2.0", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["convolution2d_45", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"input_dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 50, 50, 2]}, "inbound_nodes": []}, {"class_name": "Convolution2D", "name": "convolution2d_1", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_1", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "relu", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_2", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_2", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_1", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_1", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_3", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_3", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_2", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_2", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "Merge", "name": "merge_1", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_1", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_2", 0, 0], ["convolution2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_4", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_4", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_3", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_3", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_5", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_5", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_2", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_4", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_4", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "Merge", "name": "merge_2", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_2", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_4", 0, 0], ["merge_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_6", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_6", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_5", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_5", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_7", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_7", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_3", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_6", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_6", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"class_name": "Merge", "name": "merge_3", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_3", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_6", 0, 0], ["merge_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_8", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_8", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_3", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_7", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_7", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_7", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_9", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_9", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_4", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_8", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_8", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"class_name": "Merge", "name": "merge_4", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_4", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_8", 0, 0], ["merge_3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_10", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_10", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_4", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_9", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_9", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_9", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_11", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_11", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_5", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_10", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_10", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"class_name": "Merge", "name": "merge_5", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_5", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_10", 0, 0], ["merge_4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_12", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_12", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_5", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_11", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_11", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_11", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_13", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_13", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_6", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_12", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_12", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"class_name": "Merge", "name": "merge_6", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_6", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_12", 0, 0], ["merge_5", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_14", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_14", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_6", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_13", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_13", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_14", 0, 0]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"name": "activation_7", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_13", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_15", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_15", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_7", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_14", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_14", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_15", 0, 0]]]}, {"class_name": "Merge", "name": "merge_7", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_7", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_14", 0, 0], ["merge_6", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_16", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_16", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_7", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_15", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_15", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_16", 0, 0]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"name": "activation_8", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_15", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_17", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_17", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_8", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_16", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_16", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_17", 0, 0]]]}, {"class_name": "Merge", "name": "merge_8", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_8", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_16", 0, 0], ["merge_7", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_18", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_18", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_8", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_17", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_17", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_18", 0, 0]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"name": "activation_9", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_17", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_19", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_19", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_9", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_18", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_18", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_19", 0, 0]]]}, {"class_name": "Merge", "name": "merge_9", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_9", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_18", 0, 0], ["merge_8", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_20", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_20", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_9", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_19", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_19", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_20", 0, 0]]]}, {"class_name": "Activation", "name": "activation_10", "config": {"name": "activation_10", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_19", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_21", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_21", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_10", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_20", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_20", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_21", 0, 0]]]}, {"class_name": "Merge", "name": "merge_10", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_10", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_20", 0, 0], ["merge_9", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_22", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_22", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_10", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_21", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_21", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_22", 0, 0]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"name": "activation_11", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_21", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_23", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_23", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_11", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_22", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_22", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_23", 0, 0]]]}, {"class_name": "Merge", "name": "merge_11", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_11", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_22", 0, 0], ["merge_10", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_24", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_24", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_11", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_23", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_23", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_24", 0, 0]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"name": "activation_12", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_23", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_25", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_25", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_12", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_24", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_24", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_25", 0, 0]]]}, {"class_name": "Merge", "name": "merge_12", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_12", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_24", 0, 0], ["merge_11", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_26", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_26", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_12", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_25", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_25", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_26", 0, 0]]]}, {"class_name": "Activation", "name": "activation_13", "config": {"name": "activation_13", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_25", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_27", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_27", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_13", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_26", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_26", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_27", 0, 0]]]}, {"class_name": "Merge", "name": "merge_13", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_13", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_26", 0, 0], ["merge_12", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_28", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_28", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_13", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_27", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_27", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_28", 0, 0]]]}, {"class_name": "Activation", "name": "activation_14", "config": {"name": "activation_14", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_27", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_29", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_29", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_14", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_28", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_28", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_29", 0, 0]]]}, {"class_name": "Merge", "name": "merge_14", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_14", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_28", 0, 0], ["merge_13", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_30", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_30", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_14", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_29", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_29", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_30", 0, 0]]]}, {"class_name": "Activation", "name": "activation_15", "config": {"name": "activation_15", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_29", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_31", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_31", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_15", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_30", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_30", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_31", 0, 0]]]}, {"class_name": "Merge", "name": "merge_15", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_15", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_30", 0, 0], ["merge_14", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_32", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_32", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_15", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_31", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_31", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_32", 0, 0]]]}, {"class_name": "Activation", "name": "activation_16", "config": {"name": "activation_16", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_31", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_33", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_33", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_16", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_32", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_32", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_33", 0, 0]]]}, {"class_name": "Merge", "name": "merge_16", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_16", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_32", 0, 0], ["merge_15", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_34", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_34", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_16", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_33", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_33", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_34", 0, 0]]]}, {"class_name": "Activation", "name": "activation_17", "config": {"name": "activation_17", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_33", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_35", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_35", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_17", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_34", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_34", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_35", 0, 0]]]}, {"class_name": "Merge", "name": "merge_17", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_17", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_34", 0, 0], ["merge_16", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_36", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_36", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_17", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_35", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_35", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_36", 0, 0]]]}, {"class_name": "Activation", "name": "activation_18", "config": {"name": "activation_18", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_35", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_37", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_37", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_18", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_36", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_36", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_37", 0, 0]]]}, {"class_name": "Merge", "name": "merge_18", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_18", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_36", 0, 0], ["merge_17", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_38", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_38", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_18", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_37", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_37", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_38", 0, 0]]]}, {"class_name": "Activation", "name": "activation_19", "config": {"name": "activation_19", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_37", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_39", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_39", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_19", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_38", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_38", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_39", 0, 0]]]}, {"class_name": "Merge", "name": "merge_19", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_19", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_38", 0, 0], ["merge_18", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_40", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_40", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_19", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_39", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_39", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_40", 0, 0]]]}, {"class_name": "Activation", "name": "activation_20", "config": {"name": "activation_20", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_39", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_41", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_41", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_20", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_40", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_40", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_41", 0, 0]]]}, {"class_name": "Merge", "name": "merge_20", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_20", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_40", 0, 0], ["merge_19", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_42", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_42", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_20", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_41", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_41", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_42", 0, 0]]]}, {"class_name": "Activation", "name": "activation_21", "config": {"name": "activation_21", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batchnormalization_41", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_43", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_43", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["activation_21", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_42", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_42", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_43", 0, 0]]]}, {"class_name": "Merge", "name": "merge_21", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_21", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_42", 0, 0], ["merge_20", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_44", "config": {"dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_44", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "activation": "linear", "W_constraint": null, "nb_row": 3, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_21", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_43", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "trainable": true, "name": "batchnormalization_43", "mode": 0, "beta_regularizer": null}, "inbound_nodes": [[["convolution2d_44", 0, 0]]]}, {"class_name": "Merge", "name": "merge_22", "config": {"output_shape_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw", "arguments": {}, "mode": "sum", "name": "merge_22", "output_mask": null, "output_shape": null}, "inbound_nodes": [[["batchnormalization_43", 0, 0], ["convolution2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_45", "config": {"dim_ordering": "tf", "nb_filter": 6, "name": "convolution2d_45", "bias": true, "trainable": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_col": 1, "activation": "linear", "W_constraint": null, "nb_row": 1, "border_mode": "same", "init": "he_normal", "subsample": [1, 1]}, "inbound_nodes": [[["merge_22", 0, 0]]]}]}}